{
  "pages": [
    "/bulletins/twenty-second-sunday-in-ordinary-time-combined-25-min/1.png",
    "/bulletins/twenty-second-sunday-in-ordinary-time-combined-25-min/2.png",
    "/bulletins/twenty-second-sunday-in-ordinary-time-combined-25-min/3.png",
    "/bulletins/twenty-second-sunday-in-ordinary-time-combined-25-min/4.png"
  ],
  "text": " Twenty - Second Sunday in Ordinary Time   -   August 28, 2022  This weekend (August 27 th /28 th ), the Church celebrates the   Twenty - second  Sunday in Ordinary Time . With three months remaining in Ordinary Time,  our readings continue to serve as a reflection for the Christian soul. Through  this yearly cycle, we are constantly being reminded of what it means to be a  disciple of Jesus Christ. This weekend especially, we are reminded in readings  of the virtue of humility. In humility, we recognize our true worth before God  by recognizing our need for God in our lives.  Catholicism Explained   -   The RCIA Program  Starting on   Thursday, September 8th , we are holding our   Introductory  Session   for the   Rite of Christian Initiation for Adults (RCIA) at 6:30 PM  in the   Parish Social Hall . This year, we ’ ve renamed our weekly gathering as  Catholicism Explained . This new name emphasizes that the program is open  to all. Each year, the sessions are often attended by those desiring to enter the  Church, those who are Catholic and seeking a refresher course, and those who  are non - Catholic and simply want to learn more about the Catholic Faith.  Following the opening session on September 8th,   Catholicism Explained  will begin to meet weekly on Thursdays at 6:30 PM in the Parish Social Hall.  If you know of anyone who might be interested in this program, please invite  them to attend. For those who are non - Catholic and are interested in entering  the Church, please let me know if this weekly time will not work for your  schedule. We can work together to find a time that will work for you.  Working within our Tribunal  In addition to working on my thesis this year, I have also been asked to  begin work in our diocesan Tribunal. Initially scheduled to begin the first week  of September, I actually began weekly meetings with my counterpart in our  Tribunal shortly after returning from Washington, DC. As my counterpart will  be traveling to Rome for doctorate studies, I will be taking on their workload  until their return to the Tribunal next summer.  This means that, throughout this year, I will be serving as an advocate within  our Tribunal. An advocate serves as a representative for those who are going  through   the   marriage   nullity process   (also   referred   to   as   the   annulment  process). To better facilitate this ministry and the workload it involves, I will  be keeping afternoon office hours at our Tribunal in Fort Wayne one day a  week, generally on Tuesdays. Thankfully, this will not affect our parish  schedule in any significant way.  Did You Know? Altars  At the center of nearly every Catholic church is an altar on which the Mass  is offered. Often, one or more relics of martyrs are commonly set into the altar  into or in an altar stone within the altar. The use of relics highlight how, in the  early Church, the altar was often the tomb of a martyr. Due to the persecutions  of the time, the Church would often be forced to secretly gather together in the  catacombs to safely offer the Mass.  The altar itself has many meanings. According to the   Rite for the Dedication  of a Church , the altar   “ stands as a sign of Christ Himself, who is the priest, the  victim, and the altar of His own sacrifice. ”   The altar can also be seen to  symbolize the table of the Last Supper, the altar of the Temple in Jerusalem,  the cross of Calvary, the tomb of Christ ’ s burial and resurrection, and the altar  in heaven.   Simply put, the altar symbolizes Christ himself in the many facets  of His existence: as fulfillment of the Old Testament typologies, as God  present with His people on earth, and the prefigurement of the eternal, glorious  banquet of heaven which is wholly communion and feast.  As with all things in the church building itself, the altar serves to help us  encounter Jesus Christ. As the altar stands in the midst of the Sanctuary, so  Christ is in the midst of His people. As the altar remains fixed and present to  us, so Christ always remains present in our lives.   ~Faithfully in Christ, Fr. David  MASS INTENTIONS  Saturday, August 27  8:00 a.m. Special Intention  4:00 - 4:45 p.m.   Confession  4:35 p.m.   Rosary  5:00 p.m. Ed Bushee   +  Sunday, August 28  Twenty - Second Sunday in Ordinary Time  7:10 a.m.   Rosary  7:30 a.m.   Parish Family  9:40 a.m.   Rosary  10:00 a.m. Ann Marie Kloc   +  Monday, August 29  No Public Mass  Tuesday, August 30  8:00 a.m. Dorothy Witwer   +  8:30 a.m. Confession  Wednesday, August 31  6:00 - 7:00 p.m.   Adoration  6:00 - 6:45 p.m.   Confessions  7:00 p.m. Andrea Grover   +  Thursday, September 1  8:00 a.m. Pete Geels   +  Friday, September 2  8:30 a.m. Gertie Wyss   +  Saturday, September 3  8:00 a.m. Special Intention  4:00 - 4:45 p.m.   Confession  4:35 p.m.   Rosary  5:00 p.m. Parish Family  Sunday, September 4  Twenty - Third Sunday in Ordinary Time  7:10 a.m.   Rosary  7:30 a.m.   Virgil Burns   +  9:40 a.m.   Rosary  10:00 a.m. Mary Ann & Terry Flowers   +  Becky Biberstein, Michael Green, Frances Carr, Tom Richhart, Carol Leitner, Pat Pfeifer, Troy Cook, Bobbie and Cheryl Jackson ,   Andrea Holte,  Bonnie Burns, John Houlihan, Nora LaVine, Kimberly Abney, Sydnee Bradburn, Leanne Lee, Dr. Doug Phillips, Jeff Tillman, and M arj   Pogue.  MASS READINGS FOR THE WEEK  Monday, August 29   -   The Passion of St.  John the Baptist   -   1 Cor 2:1 - 5/ Mk 6:17 - 29  Tuesday, August 30   -   1 Cor 2:10b - 16/ Lk  4:31 - 37  Wednesday, August 31   -   1 Cor 3:1 - 9/ Lk  4:38 - 44  Thursday, September 1   -   World Day of  Prayer for the Care of Creation   -   1 Cor 3:18  - 23/ Lk 5:1 - 11  Friday, September 2   -   1 Cor 4:1 - 5/ Lk 5:33 -  39  Saturday, September 3   -   St. Gregory the  Great, Pope and Doctor of the Church   -   1  Cor 4:6b - 15/ Lk 6:1 - 5  Sunday, September 4   -   Twenty - Third Sun-  day in Ordinary Time   -   Wis 9:13 - 18b/  Phmn 9 - 10,12 - 17/ Lk 14:25 - 33 PARISH CALENDAR  •   Sat., / Sun., August 27 & 28   -   Registration Weekend at all  Masses.  •   Sat., Aug. 27   -   Confession 4 - 4:45 p.m. / Mass 5:00 p.m.  •   Sat., Aug. 27   -   Religious Education Registration Pizza & Sun-  dae Bar following evening Mass in the Parish Social Hall.  Classes begin Sunday, September 11   -   8:30 - 9:45 a.m.  •   Sun., Aug. 28   -   Mass 7:30 a.m. / Mass 10:00 a.m.  •   Tues., Aug. 30   -   Adoration 7 - 8:00 a.m. / Mass 8:00 a.m. / Con-  fessions 8:30 a.m.  •   Wed., Aug. 31   -   Adoration   -   6 - 7 p.m. / Confessions 6:00 - 6:45  p.m. / Mass 7:00 p.m.  •   Fri., Sept. 2   -   First Friday Adoration   -   (Following 8:30 a.m.  Mass) 9:00 a.m.   -   6:00 p.m. / Confessions 5:00 - 5:45 p.m. /  Mass at 6:00 p.m.  •   Sat., Sept. 3   -   Confession 4 - 4:45 p.m. / Mass 5:00 p.m.  •   Sun., Sept. 4   -   Mass 7:30 a.m. / Mass 10:00 a.m.  •   Mon., Sept. 5   -   Labor Day, Parish Office Closed today.  •   Tues., Sept. 6   -   Adoration 7 - 8:00 a.m. / Mass 8:00 a.m. / Con-  fessions 8:30 a.m.  •   Wed., Sept. 7   -   Praise & Worship Holy Hour   -   6 - 7 p.m. / Con-  fessions 6:00 - 6:45 p.m. / Mass 7:00 p.m.  •   Thurs., Sept. 8   -   Catholicism Explained   -   6:30 p.m. in the Par-  ish Social Hall.  •   Thurs., Sept. 8   -   “ Teaching Mass ”   with Fr. David   -   7:30 p.m. in  Church. All are welcome!  FIRST FRIDAY ADORATION , September 2, 2022  (Following 8:30 a.m. Mass) 9:00 a.m.   -   6:00 p.m.  Confessions 5:00 - 5:45 p.m. / Mass at 6:00 p.m.  “Spend an Hour with me.” -   Jesus  Please sign up on the sheet in the narthex.  Weekend of September 3/4, 2022  5:00   Marita Crawfis  7:30   Mike Morrissey  10:00   Teresa Smith  5:00   Carol Butler  7:30   Barb Ault  10:00   Bruce Holland  5:00   Volunteers  7:30   Volunteers  10:00   Volunteers  5:00   Audrey Mechling, Isiah Bedwell, Volunteer  7:30   Spencer McCorkle, Volunteer, Volunteer  10:00   Knights of Columbus  St. Joseph Parish Finance Report  for the Weekend of August 20/21  Adult Envelopes -   $2,897.00  Child Envelopes -   $2.00  Loose -   $382.00  Repair/Rainy Day Fund -   $4,046.55  Religious Education Fund -   $25.00  Votive Candles -   $162.50  Assumption of the Blessed Virgin  Mary -   $87.00  Total -   $7,602.05  Our weekly budget is $5,116.40  We are $2,189.60 ahead of our  budget for the month of August.  St. Vincent de Paul Fund -  $1,113.00  Your gifts to St. Joseph Parish  are greatly appreciated.  From Death To New Life  In your charity, please pray for the repose of the soul of  Miguel Garza, Jr., father of Connie Garza, who passed  away Friday, August 19, 2022.  May God welcome him home,  fill him with peace and bless those who will miss him.  Eternal Rest Grant unto him O Lord, and let Perpetual light shine up-  on him. May his soul and the souls of all the faithful departed through  the mercy of God rest in Peace. Amen.  CATHOLICISM EXPLAINED (RCIA PROGRAM)  Catholicism Explained (RCIA Program) begins Thursday, Sep-  tember 8th at 6:30 p.m. in the Parish Social Hall. The text that  will be used is   The New Saint Joseph Baltimore Catechism, No.2,  which will be provided on the first day. The first topic: Introduc-  tion & History of the Church.   At 7:30 p.m. join Fr. David for a  “ Teaching Mass ”   in the Church. All are welcome!  MANY HANDS MAKE LIGHT WORK!  On August 30th several of the Knights are going to  spend a day constructing 311 crosses to be displayed  in the Church yard for right to life.   They will be  transporting the crosses back to St. Josephs on Au-  gust 30th, as well. The G.I.R.L. ’ s NIGHT OUT group will be  meeting Tuesday, September 6th from 6:00 - 9:00 p.m. to paint the  crosses and again on Saturday, September 10th from 8:30 a.m. to  4:30 p.m. to finish them. It is important to complete the painting  of the crosses by the 10th so they may be put in the Church yard  for the start of 40 Days for Life and for the Regional Gathering of  Right to Life supporters   at our Church on September 24th from  11:00 a.m. to Noon. If you are able to help, please show up, paint  brush in hand ready to paint! Thank you!  WELCOME, CHILDREN OF GOD  Through water and the word, YARLEY ANTANELLA SANCHEZ,  HAYLEE ANAHI SANCHEZ, and ANASTASIA JANE  YAGODINSKI, became children of God and were sealed as Christ ’ s  own forever through Baptism last weekend, by Fr. David Violi. Joan Phelps,   (Parishioner)  M.A., NCC, LMHC, LCAC, CADAC, ICAC, CCDP - D  Licensed Mental Health Counselor  Individual, Marriage / Family Counseling  Addictions Counseling  Spiritual/Pastoral Counseling  Career Assessment/Counseling  260 - 824 - 9353  604 Greenbriar Drive, Bluffton, IN 46714  2155 N Main St   (260) 824 - 9643  Interurban Park  Bluffton, IN 46714  Dan Geimer, Gemologist(GIA)  www.daniels - jewelers.net  Dan & Jane Geimer Parishioners  GORDON & ASSOCIATES,  P.C., Attorneys  Dan Gordon, Tony Crowell  Michelle Adler, Matt Hayes, and  Brigitte Washburn  260 - 824 - 9377  Dan Gordon, Parishioner  Matt Hayes, Parishioner at  St. Vincent de Paul  FAIRWAY FLOOR COVERING  Residential and Commercial  1503 W. Lancaster St., Bluffton  Charles Thompson  260 - 824 - 3049  Open -   Monday   -   Friday, 8a - 5p  Kris Thompson –   260 - 820 - 2333  Kent Thompson –   260 - 307 - 6584  Bekkee Thompson –   260 - 273 - 6354  Kris Thompson, Parishioner  The Grover Company  Property Management  Fully Licensed and Insured  260 - 820 - 0638  Bret Grover  Knights of Columbus  Father Aloysius Phillips  Council 7555  Grover Sheets, Wells  Veterans, American  Legion Post 111  111 W. Washington St  Bluffton   -   260 - 824 - 3815  Open to the Public  Tuesday thru Saturday 11:00 a.m.  Dine in or Carry Out!  It ’ s a   child , not a  choice ...  Abortion does not make  you   “ un - pregnant ”,   it  makes you the mother  of a dead child.  3320 East State Road 124  Bluffton, IN 46714  260 - 824 - 3852  Douglas L. Cale  Mitch Harnish  Sam Haiflich, Parishioner  St. Aloysius Parish, Yoder, IN  Spread   love  everywhere you go.  Let no one ever  come to you  without leaving  happier.  - St. Mother Teresa  116 E. Dustman Road, Bluffton  260.824.4263  Monday, Wednesday & Thursday 9am - 5pm  109 E. Huntington St., Montpelier  765.209.4614  Tuesday 10am - 4pm  * Taking New Patients  * Emergency Exams Available  P:   260 - 824 - 2442  F:   260 - 824 - 8101  Awesome Hair  122 N. Johnson St.  Bluffton, IN  Carmie Anderson,  parishioner  Colin Z. Andrews  Tel: (260) 824 - 4049  Fax: (260) 827 - 5099  candrews@andrewsandcrell.com  www.andrewsandcrell.com  Bluffton: 116 S. Main St., Bluffton, IN 46714  Fort Wayne: 7617 W Jefferson Blvd., Suite F  Fort Wayne, IN 46804  Parishioner  Everything rustic, primitive  and country for your home.  Visit the bereavement shop  for cemetery saddles, vases,  lanterns wind chimes, throws,  stepping stones and other  bereavement items.  Hours: Friday & Saturday  10 am to 4 pm.  Or by appointment:  260 - 273 - 0222"
}