{
  "pages": [
    "/bulletins/combinepdf-26-twenty-third-sunday-in-ordinary-time-min/1.png",
    "/bulletins/combinepdf-26-twenty-third-sunday-in-ordinary-time-min/2.png",
    "/bulletins/combinepdf-26-twenty-third-sunday-in-ordinary-time-min/3.png",
    "/bulletins/combinepdf-26-twenty-third-sunday-in-ordinary-time-min/4.png"
  ],
  "text": " Twenty - Third Sunday in Ordinary Time   -   September 4, 2022  Join us this Monday, September 5th, at 9 AM for a special Labor Day Mass.  Thank you to Fr. Bill Sullivan, who will be the celebrant for this Mass.  This weekend (September 3 rd /4 th ), the Church celebrates the   Twenty - third  Sunday in Ordinary Time . A special   “ Thank You! ”   to all who participated in  our Registration and Ministry Sign - up last weekend. If you did not have the  opportunity to sign - up to receive more information about any of our ongoing  ministries or to suggest a new ministry, please contact the Parish Office.  Catholicism Explained & Teaching Mass  This Thursday, September 8 th , we will host the introduction for   Catholicism  Explained   at 6:30 PM in the Parish Social Hall . This weekly series will dive  into a walk - through of our Faith, using the   St. Joseph Baltimore Catechism   as  a basic guide. I encourage you to personally invite those that you know would  be interested in learning more about our Faith. And, after inviting them, I also  encourage you to come and join them along in this journey.  Immediately following the introduction to   Catholicism Explained , there  will be a   “ Teaching Mass ”   offered at 7:30 PM in the Church. This walk -  through of the liturgy will allow us to look at the various parts of the Mass and  gain a deeper appreciation for the Mass as a whole. All are welcome to this  event. ( Note : A   “ Teaching Mass ”   is not an actual Mass; Our daily Mass on  Thursday, September 8th, will be at 8 AM.)  Crucifixes, Home Blessings, and Tribunal Updates  This past week, I began to reach out to those who requested a house blessing  in addition to our Easter gift of a crucifix. Thank you for your patience as I  work through the contact list over the next several weeks. I plan to visit and  bless several homes per week. If you did not have the chance to sign up and  would like to arrange a home blessing, please contact the Parish Office.  After my first day at the Tribunal, it was clear that I will need, as I begin, to  dedicate two days a week to this ministry. In addition to new marriage nullity  cases that I am being assigned, I have also inherited 20+ active cases that are  all at various stages. Thankfully, our Tribunal staff has been very welcoming  and are a great help to me as I become adjusted to this new ministry.  As a marriage nullity case nears completion, the case file itself can become  several hundred pages long. As the advocate assigned to these cases, I will  need to spend the next several weeks familiarizing myself with each case and  where it is in the nullity process. To do this, I will be increasing my afternoon  office hours in our Tribunal in Fort Wayne from Tuesdays to Tuesdays and  Thursdays for the next several weeks. Thankfully, again, this change will not  alter our parish schedule in any foreseeable way.  Did You Know? The Tabernacle and the Sanctuary Lamp  When one enters a Catholic church, they are never truly alone. Given the  Catholic teaching of Jesus ’   true presence in the Eucharist (cf. John 6:25 - 71),  the Tabernacle reminds us of the presence of God among us. This reality is  reflected by the lit sanctuary lamb ( or eternal flame ) that burns continuously in  the Sanctuary whenever the Eucharist is present within the Tabernacle.  Initially, the Eucharist was reserved to provide Holy Communion to the sick  and dying and for those unable to attend the Sunday liturgy. As appreciation of  Jesus ’   presence in the Eucharist became more developed, however, Christians  then desired to show reverence for His continuing presence in their midst  through prayer. From the fourth century onward, the practice of reserving the  Holy Eucharist in churches was a generally accepted practice.  In our modern day, the Eucharist is reserved in Tabernacles throughout the  world. This reminds us both of Jesus ’   presence and, through and in Him, our  unity. May we make use of this opportunity to spend time with our Eucharistic  Lord in prayer. In the words of St. Josemaría Escrivá:   “ When you approach the  Tabernacle, remember that He has been awaiting you for twenty centuries. ”  MASS INTENTIONS  Saturday, September 3  8:00 a.m. Special Intention  4:00 - 4:45 p.m.   Confession  4:35 p.m.   Rosary  5:00 p.m. Parish Family  Sunday, September 4  Twenty - Third Sunday in Ordinary Time  7:10 a.m.   Rosary  7:30 a.m.   Virgil Burns   +  9:40 a.m.   Rosary  10:00 a.m. Mary Ann & Terry Flowers   +  Monday, September 5  Labor Day  9:00 a.m.   Beatrice Hickert   +  Tuesday, September 6  8:00 a.m.   Marcel Leon Lichtsinn   +  Infant son of Briar & Andrea Lichtsinn  8:30 a.m. Confession  Wednesday, September 7  6:00 - 7:00 p.m.   Adoration  6:00 - 6:45 p.m.   Confessions  7:00 p.m. Mrs. Susie Arnold   +  Thursday, September 8  8:00 a.m. Greg Mayer   +  Friday, September 9  8:30 a.m. Anthony Christie   +  Saturday, September 10  8:00 a.m. Special Intention  4:00 - 4:45 p.m.   Confession  4:35 p.m.   Rosary  5:00 p.m. Joan Scheidler   +  Sunday, September 11  Twenty - Fourth Sunday in Ordinary Time  7:10 a.m.   Rosary  7:30 a.m.   Parish Family  9:40 a.m.   Rosary  10:00 a.m. David Black   +  Becky Biberstein, Michael Green, Frances Carr, Tom Richhart, Carol Leitner, Pat Pfeifer, Troy Cook, Bobbie and Cheryl Jackson ,   Andrea Holte,  Bonnie Burns, John Houlihan, Nora LaVine, Kimberly Abney, Sydnee Bradburn, Leanne Lee, Dr. Doug Phillips, Jeff Tillman, and M arj   Pogue.  MASS READINGS FOR THE WEEK  Monday, September 5   -   Labor Day   -   1 Cor  5:1 - 8/ Lk 6:6 - 11  Tuesday, September 6   -   1 Cor 6:1 - 11/ Lk  6:12 - 19  Wednesday, September 7   -   1 Cor 7:25 - 31/  Lk 6:20 - 26  Thursday, September 8   -   The Nativity of  the Blessed Virgin Mary   -   Mi 5:1 - 4a or Rom  8:28 - 30/ Mt 1:1 - 16,18 - 23 or 1:18 - 23  Friday, September 9   -   St. Peter Claver,  Priest   -   1 Cor 9:16 - 19,22b - 27/ Lk 6:39 - 42  Saturday, September 10   -   1 Cor 10:14 - 22/  Lk 6:43 - 49  Sunday, September 11   -   Twenty - Fourth  Sunday in Ordinary Time   -   Ex 32:7 - 11,13 -  14/ 1 Tm 1:12 - 17/ Lk 15:1 - 32 or 15:1 - 10 PARISH CALENDAR  •   Sat., Sept. 3   -   Confession 4 - 4:45 p.m. / Mass 5:00 p.m.  •   Sun., Sept. 4   -   Mass 7:30 a.m. / Mass 10:00 a.m.  •   Mon., Sept. 5   -   Mass 9:00 a.m.  •   Mon., Sept. 5   -   Labor Day, Parish Office Closed today.  •   Tues., Sept. 6   -   Adoration 7 - 8:00 a.m. / Mass 8:00 a.m. / Con-  fessions 8:30 a.m.  •   Wed., Sept. 7   -   Praise & Worship Holy Hour   -   6 - 7 p.m. / Con-  fessions 6:00 - 6:45 p.m. / Mass 7:00 p.m.  •   Wed., Sept. 7   -   Parish Council   -   7:30 p.m.  •   Wed., Sept. 7   -   Choir Practice   -   7:30 p.m.  •   Thurs., Sept. 8   -   Catholicism Explained   -   6:30 p.m. in the Par-  ish Social Hall.  •   Thurs., Sept. 8   -   “ Teaching Mass ”   with Fr. David   -   7:30 p.m. in  Church. All are welcome!  •   Sat., Sept. 10   -   Confession 4 - 4:45 p.m. / Mass 5:00 p.m.  •   Sun., Sept. 11   -   Mass 7:30 a.m. / Mass 10:00 a.m.  •   Sun., Sept. 11   -   Religious Education Class resumes   -   8:30 - 9:45  a.m.  •   Tues., Sept. 13   -   Adoration 7 - 8:00 a.m. / Mass 8:00 a.m. / Con-  fessions 8:30 a.m.  •   Wed., Sept. 14   -   Adoration   -   6 - 7 p.m. / Confessions 6:00 - 6:45  p.m. / Mass 7:00 p.m.  •   Wed., Sept. 14   -   Choir Practice   -   7:30 p.m.  Weekend of September 10/11, 2022  5:00   Bruce Holland  7:30   Donna Geisel  10:00   Jay Crisp  5:00   Ginny Fenstermaker  7:30   Ben Wagner  10:00   Patti Clark - Johnson  5:00   Volunteers  7:30   Volunteers  10:00   Volunteers  5:00   Angel/Zoe Soto, Isiah Bedwell  7:30   Abby/Adrienne Wagner, Volunteer  10:00   Grant Reifsteck, Gabby Hoffacker, Gracie Haiflich KNIGHTS OF COLUMBUS MEETING  Tuesday, September 6, 2022  Recitation of the Holy Rosary 6:40 p.m. in Church,  meeting in Parish Social Hall at 7:00 p.m.   St. Joseph Parish Finance Report  for the Weekend of August 28/29  Adult Envelopes -   $6,590.00  Child Envelopes -   $0  Loose -   $156.00  Repair/Rainy Day Fund -   $6,623.30  Religious Education Fund -   $20.00  Votive Candles -   $74.00  Assumption of the Blessed Virgin  Mary -   $5.00  Total -   $13,468.30  Our weekly budget is $5,116.40  We are $10,541.50 ahead of our  budget for the month of August.  St. Vincent de Paul Fund -   $70.00  Your gifts to St. Joseph Parish  are greatly appreciated.  From Death To New Life  In your charity, please pray for the repose of the soul of  Debra McCormick, sister of Bob (Penney) Burns, who  passed away Tuesday, August 23, 2022.  May God welcome him home,  fill him with peace and bless those who will miss him.  Eternal Rest Grant unto him O Lord, and let Perpetual light shine up-  on him. May his soul and the souls of all the faithful departed through  the mercy of God rest in Peace. Amen.  Children ’ s 2022 - 2023 Choir Season  Please come and make a joyful song to the  Lord! Children ’ s Choir will begin on Tues-  day October 4 th . Practice will be from 5:30 -  6:30 pm in the conference room. Any young  person ages 7 - 14 is invited to join! Please contact Teresa Smith at  tersalsmith2000@yahoo.com   for more information.  NEW CHOIR MEMBERS WELCOME!  The Adult Choir at St. Joseph will have their first  choir practice on Wednesday, September 7th at  7:30 p.m. If you enjoy singing and would like to  serve in this important ministry please contact  Teresa Smith at   teresalsmith2000@yahoo.com   for more information.  MANY HANDS MAKE LIGHT WORK!  The G.I.R.L. ’ s NIGHT   OUT group   will be   meeting  Tuesday, September 6th from 6:00 - 9:00 p.m. and  Saturday, September 10th from 8:30 a.m. to 4:30 p.m.,  to paint crosses made by the Knights of Columbus earli-  er in the week. These crosses will be put on Church  grounds during the 40 Days for Like to represent babies  who have died from abortion. If you would like to help,  please bring a paint brush. Thank you!  Catholicism Explained (RCIA Program) will begin  Thursday, September 8th at 630 p.m. in the Parish Social  Hall. The first topic will be the Introduction and History of  the Church in   The New Saint Joseph Baltimore Catechism,  No. 2,   which will be given to you that evening. At 7:30 p.m.  join Fr. David for a   “ Teaching Mass ”   in the Church.  All are welcome!  Confession 6 - 6:45 p.m. / Mass at 7:00 p.m. Joan Phelps,   (Parishioner)  M.A., NCC, LMHC, LCAC, CADAC, ICAC, CCDP - D  Licensed Mental Health Counselor  Individual, Marriage / Family Counseling  Addictions Counseling  Spiritual/Pastoral Counseling  Career Assessment/Counseling  260 - 824 - 9353  604 Greenbriar Drive, Bluffton, IN 46714  2155 N Main St   (260) 824 - 9643  Interurban Park  Bluffton, IN 46714  Dan Geimer, Gemologist(GIA)  www.daniels - jewelers.net  Dan & Jane Geimer Parishioners  GORDON & ASSOCIATES,  P.C., Attorneys  Dan Gordon, Tony Crowell  Michelle Adler, Matt Hayes, and  Brigitte Washburn  260 - 824 - 9377  Dan Gordon, Parishioner  Matt Hayes, Parishioner at  St. Vincent de Paul  FAIRWAY FLOOR COVERING  Residential and Commercial  1503 W. Lancaster St., Bluffton  Charles Thompson  260 - 824 - 3049  Open -   Monday   -   Friday, 8a - 5p  Kris Thompson –   260 - 820 - 2333  Kent Thompson –   260 - 307 - 6584  Bekkee Thompson –   260 - 273 - 6354  Kris Thompson, Parishioner  The Grover Company  Property Management  Fully Licensed and Insured  260 - 820 - 0638  Bret Grover  Knights of Columbus  Father Aloysius Phillips  Council 7555  Grover Sheets, Wells  Veterans, American  Legion Post 111  111 W. Washington St  Bluffton   -   260 - 824 - 3815  Open to the Public  Tuesday thru Saturday 11:00 a.m.  Dine in or Carry Out!  It ’ s a   child , not a  choice ...  Abortion does not make  you   “ un - pregnant ”,   it  makes you the mother  of a dead child.  3320 East State Road 124  Bluffton, IN 46714  260 - 824 - 3852  Douglas L. Cale  Mitch Harnish  Sam Haiflich, Parishioner  St. Aloysius Parish, Yoder, IN  Spread   love  everywhere you go.  Let no one ever  come to you  without leaving  happier.  - St. Mother Teresa  116 E. Dustman Road, Bluffton  260.824.4263  Monday, Wednesday & Thursday 9am - 5pm  109 E. Huntington St., Montpelier  765.209.4614  Tuesday 10am - 4pm  * Taking New Patients  * Emergency Exams Available  P:   260 - 824 - 2442  F:   260 - 824 - 8101  Awesome Hair  122 N. Johnson St.  Bluffton, IN  Carmie Anderson,  parishioner  Colin Z. Andrews  Tel: (260) 824 - 4049  Fax: (260) 827 - 5099  candrews@andrewsandcrell.com  www.andrewsandcrell.com  Bluffton: 116 S. Main St., Bluffton, IN 46714  Fort Wayne: 7617 W Jefferson Blvd., Suite F  Fort Wayne, IN 46804  Parishioner  Everything rustic, primitive  and country for your home.  Visit the bereavement shop  for cemetery saddles, vases,  lanterns wind chimes, throws,  stepping stones and other  bereavement items.  Hours: Friday & Saturday  10 am to 4 pm.  Or by appointment:  260 - 273 - 0222"
}